src/AccumulationRegisters/РасчетыНалоговыхАгентовСБюджетомПоНДФЛ/РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыНалоговыхАгентовСБюджетомПоНДФЛ</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РеквизитыПлатежногоПоручения</name>
    <comment>АПК:58</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийСрокУплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ставка</name>
    <type>
      <types>EnumRef.НДФЛСтавки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцНалоговогоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВключатьВДекларациюПоНалогуНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсчисленоПоДивидендам</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/РасчетыНалогоплательщиковСБюджетомПоНДФЛ/РасчетыНалогоплательщиковСБюджетомПоНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыНалогоплательщиковСБюджетомПоНДФЛ</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСПревышения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НалогНаПрибыльДляДивидендов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.ТерриторияВыполненияРаботВОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ДокументыОснованияНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантУдержания</name>
    <type>
      <types>EnumRef.ВариантыУдержанияНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВДекларациюПоНалогуНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетМежрасчетногоПериода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВыплаченногоДохода</name>
    <comment>АПК:58 </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПеречисления</name>
    <type>
      <types>EnumRef.СрокиПеречисляемогоНалога</types>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийСрокУплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВыплаченныйДоходВ6НДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияДоходаФиксирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстаревшаяДатаПолученияДохода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗарегистрированоПриНачисленииАванса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНалогообложенияРезидента</name>
    <type>
      <types>EnumRef.НДФЛСтавкиНалогообложенияРезидента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцНалоговогоПериода</name>
    <comment>АПК:58 имя сохранено ради обратной совместимости</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДохода</name>
    <comment>АПК:58 имя ВидДохода уже занято</comment>
    <type>
      <types>EnumRef.КатегорииДоходовНДФЛ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьКодДохода</name>
    <type>
      <types>CatalogRef.УдалитьВидыДоходовНДФЛ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДохода</name>
    <type>
      <types>CatalogRef.ВидыДоходовНДФЛ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/НДФЛРасчетыНалоговыхАгентовСБюджетом/НДФЛРасчетыНалоговыхАгентовСБюджетом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НДФЛРасчетыНалоговыхАгентовСБюджетом</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСПревышения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ/РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСПревышения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантУдержания</name>
    <type>
      <types>EnumRef.ВариантыУдержанияНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийСрокУплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МесяцНалоговогоПериода</name>
    <comment>АПК:58 имя сохранено ради обратной совместимости</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ведомость</name>
    <type>
      <types>DocumentRef.ПлатежнаяВедомость</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНалогообложенияРезидента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДохода</name>
    <type>
      <types>CatalogRef.КодыДоходовНДФЛ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/РасчетыСФондамиПоСтраховымВзносамУНФ/РасчетыСФондамиПоСтраховымВзносамУНФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСФондамиПоСтраховымВзносамУНФ</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <comment>Это может быть как головная организация, так и обособленное подразделение</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбязательногоСтрахованияСотрудников</name>
    <type>
      <types>EnumRef.ВидыОбязательногоСтрахованияСотрудниковУНФ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоСтраховыеВзносы</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоРасчетыПоНачислениюУплатеВзносовВФСС</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/СистемыНалогообложенияОрганизаций/СистемыНалогообложенияОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СистемыНалогообложенияОрганизаций</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>СистемаНалогообложения</name>
    <type>
      <types>EnumRef.СистемыНалогообложения</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикУСН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикЕНВД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяПатент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъектНалогообложения</name>
    <type>
      <types>EnumRef.ВидыОбъектовНалогообложения</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаНалога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПлательщикТорговыйСбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РозничнаяПродажаАлкоголя</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПовышеннаяСтавкаНалога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяАУСН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикЕНП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСН/РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСН</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

src/Enums/НДФЛСтавки/НДФЛСтавки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НДФЛСтавки</name>
  <enumValues>
    <name>Ставка13</name>
  </enumValues>
  <enumValues>
    <name>Ставка30</name>
  </enumValues>
  <enumValues>
    <name>Ставка35</name>
  </enumValues>
  <enumValues>
    <name>Ставка09</name>
  </enumValues>
  <enumValues>
    <name>Ставка15</name>
  </enumValues>
  <enumValues>
    <name>Ставка05</name>
  </enumValues>
  <enumValues>
    <name>Ставка10</name>
  </enumValues>
  <enumValues>
    <name>Ставка03</name>
  </enumValues>
  <enumValues>
    <name>Ставка06</name>
  </enumValues>
  <enumValues>
    <name>Ставка07</name>
  </enumValues>
  <enumValues>
    <name>Ставка12</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВариантыУдержанияНДФЛ/ВариантыУдержанияНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыУдержанияНДФЛ</name>
  <enumValues>
    <name>Удержано</name>
  </enumValues>
  <enumValues>
    <name>ПереданоНаВзысканиеВНалоговыйОрган</name>
  </enumValues>
  <enumValues>
    <name>ВозвращеноНалоговымАгентом</name>
  </enumValues>
  <enumValues>
    <name>ЗачетАвансовыхПлатежей</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыОбязательногоСтрахованияСотрудниковУНФ/ВидыОбязательногоСтрахованияСотрудниковУНФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОбязательногоСтрахованияСотрудниковУНФ</name>
  <enumValues>
    <name>ПФРСтраховая</name>
  </enumValues>
  <enumValues>
    <name>ПФРНакопительная</name>
  </enumValues>
  <enumValues>
    <name>ФСС</name>
  </enumValues>
  <enumValues>
    <name>ФФОМС</name>
  </enumValues>
  <enumValues>
    <name>ТФОМС</name>
  </enumValues>
  <enumValues>
    <name>ФССНесчастныеСлучаи</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаКПенсииЛетчикам</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаКПенсииШахтерам</name>
  </enumValues>
  <enumValues>
    <name>ПФРПоСуммарномуТарифу</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/РегламентированнаяОтчетностьСотрудники/Module.bsl
#Область ПрограммныйИнтерфейс

///////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ РАБОТЫ С РЕГЛАМЕНТИРОВАННОЙ ОТЧЕТНОСТЬЮ ПО СОТРУДНИКАМ


Функция ВыполнитьРасчетВзносовИНалоговПоСотрудникам(Организация,ПериодРасчета, СобытиеКалендаря, ТринадцатыйПериод = Ложь) Экспорт
	
	ДатаНачалаОбязательногоПримененияЕНП = РегламентированнаяОтчетностьУСН.ДатаОбязательногоПримененияЕНП();
	
	СтруктураРасчета = Новый Структура(
	"Организация,
	|СобытиеКалендаря,
	|ПериодОтчетности,
	|НДФЛСотрудники,
	|НДФЛСвышеПредельнойВеличины,
	|ПФРПоСуммарномуТарифу,
	|ПФРНакопительнаяСотрудники,
	|ПФРСтраховаяСотрудники,
	|ФСССотрудники,
	|ФССТравматизмСотрудники,
	|ФОМССотрудники,
	|ВидВзаиморасчетовСБюджетом,
	|СуммаВзаиморасчетовСБюджетом,
	|ДокументВзаиморасчетовСБюджетом,
	|СуммаНалога",
	Организация,
	СобытиеКалендаря,
	ПериодРасчета,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	Справочники.ВидыНалогов.ПустаяСсылка(),
	0,
	Неопределено,
	0);
	
	Запрос = Новый Запрос;
	Если ПериодРасчета > ДатаНачалаОбязательногоПримененияЕНП 
		И ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйУчет")
		И ПериодРасчета < '20230701'Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.СуммаПриход КАК НДФЛ,
		|	0 КАК НДФЛСПревышения
		|ИЗ
		|	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Обороты(&НачалоПериода, &ДатаОкончанияРасчетаНДФЛПоДатеНачисления, , Организация = &Организация) КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты
		|ГДЕ
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.СуммаПриход
		|ИЗ
		|	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Обороты(&НачалоПериода, &ДатаОкончанияРасчетаНДФЛПоДатеНачисления, , Организация = &Организация) КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты
		|ГДЕ
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма КАК НДФЛ,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения КАК НДФЛСПревышения
		|ИЗ
		|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
		|ГДЕ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Период МЕЖДУ &НачалоПериодаНДФЛ И &ОкончаниеПериодаНДФЛ
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Активность
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеСтраховыеВзносыОбороты.ПФРДоПредельнойВеличиныОборот КАК ПФРПоСуммарномуТарифуОборот,
		|	ИсчисленныеСтраховыеВзносыОбороты.ПФРНакопительнаяОборот КАК ПФРНакопительнаяОборот,
		|	ИсчисленныеСтраховыеВзносыОбороты.ПФРСтраховаяОборот КАК ПФРСтраховаяОборот,
		|	ИсчисленныеСтраховыеВзносыОбороты.ФФОМСОборот КАК ФФОМСОборот,
		|	ИсчисленныеСтраховыеВзносыОбороты.ФССОборот КАК ФССОборот,
		|	ИсчисленныеСтраховыеВзносыОбороты.ФССНесчастныеСлучаиОборот КАК ФССНесчастныеСлучаиОборот
		|ИЗ
		|	РегистрНакопления.ИсчисленныеСтраховыеВзносы.Обороты(&НачалоПериода, &ОкончаниеПериода, , Организация = &Организация) КАК ИсчисленныеСтраховыеВзносыОбороты";
		
	ИначеЕсли ПериодРасчета > ДатаНачалаОбязательногоПримененияЕНП 
		И ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйУчет")
		И ПериодРасчета > '20230701'Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.СуммаПриход КАК НДФЛ,
		|	0 КАК НДФЛСПревышения
		|ИЗ
		|	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Обороты(&НачалоПериода, &ДатаОкончанияРасчетаНДФЛПоДатеНачисления, , Организация = &Организация) КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты
		|ГДЕ
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.СуммаПриход
		|ИЗ
		|	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Обороты(&НачалоПериода, &ДатаОкончанияРасчетаНДФЛПоДатеНачисления, , Организация = &Организация) КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты
		|ГДЕ
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма КАК НДФЛ,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения КАК НДФЛСПревышения
		|ИЗ
		|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
		|ГДЕ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Период МЕЖДУ &НачалоПериодаНДФЛ И &ОкончаниеПериодаНДФЛ
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Активность
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Организация = &Организация";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|	НДФЛНалогОбороты.СуммаПриход КАК НДФЛ,
		|	НДФЛНалогОбороты.СуммаСПревышенияПриход КАК НДФЛСПревышения
		|ИЗ
		|	РегистрНакопления.НДФЛРасчетыНалоговыхАгентовСБюджетом.Обороты(&НачалоПериода, &ДатаОкончанияРасчетаНДФЛПоДатеНачисления, , Организация = &Организация) КАК НДФЛНалогОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ.Сумма КАК НДФЛ,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ.СуммаСПревышения КАК НДФЛСПревышения
		|ИЗ
		|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ
		|ГДЕ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ.Период МЕЖДУ &НачалоПериодаНДФЛ И &ОкончаниеПериодаНДФЛ
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ.Активность
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРПоСуммарномуТарифу)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПФРПоСуммарномуТарифуОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРНакопительная)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПФРНакопительнаяОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРСтраховая)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПФРСтраховаяОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФФОМС)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ФФОМСОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФСС)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ФССОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФССНесчастныеСлучаи)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ФССНесчастныеСлучаиОборот
		|ИЗ
		|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносамУНФ.Обороты(&НачалоПериода, &ОкончаниеПериода, , Организация = &Организация) КАК РасчетыСФондамиПоСтраховымВзносамОбороты";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("ДатаОкончанияРасчетаНДФЛПоДатеНачисления", ДатаНачалаОбязательногоПримененияЕНП - 1);  
	
	
	Если ПериодРасчета >= ДатаНачалаОбязательногоПримененияЕНП Тогда
		Если ТринадцатыйПериод Тогда // 23-31 декабря
			ДатаНачалаОтбораНДФЛ    = Дата(Год(ПериодРасчета), Месяц(ПериодРасчета), 23);
			ДатаОкончанияОтбораНДФЛ = КонецГода(ПериодРасчета);
		ИначеЕсли НачалоМесяца(ПериодРасчета) = НачалоГода(ПериодРасчета) Тогда // Январь
			ДатаНачалаОтбораНДФЛ    = НачалоГода(ПериодРасчета);
			ДатаОкончанияОтбораНДФЛ = Дата(Год(ПериодРасчета), Месяц(ПериодРасчета), 22);
		Иначе // остальные периоды
			ДатаНачалаОтбораНДФЛ    = Дата(Год(ПериодРасчета), Месяц(ПериодРасчета)-1, 23);
			ДатаОкончанияОтбораНДФЛ = Дата(Год(ПериодРасчета), Месяц(ПериодРасчета), 22);
		КонецЕсли;
	Иначе
		ДатаНачалаОтбораНДФЛ    = НачалоМесяца(ПериодРасчета);
		ДатаОкончанияОтбораНДФЛ = КонецМесяца(ПериодРасчета)
	КонецЕсли;
	Запрос.УстановитьПараметр("НачалоПериодаНДФЛ", ДатаНачалаОтбораНДФЛ);
	Запрос.УстановитьПараметр("ОкончаниеПериодаНДФЛ", ДатаОкончанияОтбораНДФЛ);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	// НДфЛ
	СтруктураРасчета.НДФЛСотрудники = 0;
	СтруктураРасчета.НДФЛСвышеПредельнойВеличины = 0;
	
	Выборка = Пакет[0].Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураРасчета.НДФЛСотрудники = Выборка.НДФЛ;
		СтруктураРасчета.НДФЛСвышеПредельнойВеличины = Выборка.НДФЛСПревышения;
	КонецЕсли;
	
	Выборка = Пакет[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураРасчета.НДФЛСотрудники = СтруктураРасчета.НДФЛСотрудники + Выборка.НДФЛ;
		СтруктураРасчета.НДФЛСвышеПредельнойВеличины = СтруктураРасчета.НДФЛСвышеПредельнойВеличины + Выборка.НДФЛСПревышения;
	КонецЦикла;           
	
	Если ПериодРасчета < '20230701' Тогда
		
		Выборка = Пакет[2].Выбрать();
		Если Выборка.Следующий() Тогда
			Если Год(ПериодРасчета) > 2013 Тогда
				СтруктураРасчета.ПФРСтраховаяСотрудники = Выборка.ПФРПоСуммарномуТарифуОборот;
			Иначе
				СтруктураРасчета.ПФРСтраховаяСотрудники = Выборка.ПФРСтраховаяОборот;
			КонецЕсли;
			СтруктураРасчета.ПФРНакопительнаяСотрудники = Выборка.ПФРНакопительнаяОборот;
			СтруктураРасчета.ФСССотрудники = Выборка.ФССОборот;
			СтруктураРасчета.ФОМССотрудники = Выборка.ФФОМСОборот;
			СтруктураРасчета.ФССТравматизмСотрудники = Выборка.ФССНесчастныеСлучаиОборот;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		СистемаНалогообложения = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(
		Организация, ТекущаяДатаСеанса()); 
		Если СистемаНалогообложения.ПрименяетсяАУСН И ПериодРасчета < '20230701' Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ДатаСреза", ПериодРасчета);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСНСрезПоследних.Размер КАК Размер
			|ИЗ
			|	РегистрСведений.РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСН.СрезПоследних(&ДатаСреза, ) КАК РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСНСрезПоследних";
			
			Результат = Запрос.Выполнить().Выгрузить();
			Если Результат.Количество() = 0 Тогда
				Размер = 0;
			Иначе
				Размер = Результат[0].Размер;
			КонецЕсли;
			
			МесячныйРазмерВзноса = Окр(Размер / 12, 2); 
			
			СтруктураРасчета.ФССТравматизмСотрудники = МесячныйРазмерВзноса;
			
			СтруктураРасчета.ПФРСтраховаяСотрудники = 0; СтруктураРасчета.ПФРСтраховаяСотрудники = 0;
			СтруктураРасчета.ФСССотрудники = 0; СтруктураРасчета.ФОМССотрудники = 0;	
		КонецЕсли;
		
	КонецЕсли;
	
	НачатьТранзакцию();
	
	СтруктураРасчета.СуммаНалога = СтруктураРасчета.НДФЛСотрудники+
	        СтруктураРасчета.НДФЛСвышеПредельнойВеличины+
			СтруктураРасчета.ПФРСтраховаяСотрудники+
			СтруктураРасчета.ПФРНакопительнаяСотрудники+
			СтруктураРасчета.ФСССотрудники+
			СтруктураРасчета.ФОМССотрудники+
			СтруктураРасчета.ФССТравматизмСотрудники;
	
		// запись состояние события календаря
	Если СобытиеКалендаря <> Неопределено Тогда
		
		КалендарьОтчетности.ЗаписатьСостояниеСобытияКалендаря(
			Организация,
			СобытиеКалендаря,
			Перечисления.СостоянияСобытийКалендаря.Ознакомиться,
			"",
			СтруктураРасчета.СуммаНалога);
			
		
	КонецЕсли;
	РегламентированнаяОтчетностьУСН.ОтразитьЗначенияПоказателейОтчетности(СтруктураРасчета);
	
	
	ЗафиксироватьТранзакцию();
	
	Возврат СтруктураРасчета;
	
КонецФункции    

///////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ РАБОТЫ С РЕГЛАМЕНТИРОВАННОЙ ОТЧЕТНОСТЬЮ ПО СОТРУДНИКАМ


Функция ВыполнитьРасчетВзносовПоСотрудникам(Организация,ПериодРасчета, СобытиеКалендаря, ТринадцатыйПериод = Ложь) Экспорт
	
	ДатаНачалаОбязательногоПримененияЕНП = РегламентированнаяОтчетностьУСН.ДатаОбязательногоПримененияЕНП();
	
	СтруктураРасчета = Новый Структура(
	"Организация,
	|СобытиеКалендаря,
	|ПериодОтчетности,
	|ПФРПоСуммарномуТарифу,
	|ПФРНакопительнаяСотрудники,
	|ПФРСтраховаяСотрудники,
	|ФСССотрудники,
	|ФССТравматизмСотрудники,
	|ФОМССотрудники,
	|ВидВзаиморасчетовСБюджетом,
	|СуммаВзаиморасчетовСБюджетом,
	|ДокументВзаиморасчетовСБюджетом,
	|СуммаНалога",
	Организация,
	СобытиеКалендаря,
	ПериодРасчета,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	Справочники.ВидыНалогов.ПустаяСсылка(),
	0,
	Неопределено,
	0);
	
	Запрос = Новый Запрос;
	Если ПериодРасчета > ДатаНачалаОбязательногоПримененияЕНП 
		И ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйУчет") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИсчисленныеСтраховыеВзносыОбороты.ПФРДоПредельнойВеличиныОборот КАК ПФРПоСуммарномуТарифуОборот,
		               |	ИсчисленныеСтраховыеВзносыОбороты.ПФРНакопительнаяОборот КАК ПФРНакопительнаяОборот,
		               |	ИсчисленныеСтраховыеВзносыОбороты.ПФРСтраховаяОборот КАК ПФРСтраховаяОборот,
		               |	ИсчисленныеСтраховыеВзносыОбороты.ФФОМСОборот КАК ФФОМСОборот,
		               |	ИсчисленныеСтраховыеВзносыОбороты.ФССОборот КАК ФССОборот,
		               |	ИсчисленныеСтраховыеВзносыОбороты.ФССНесчастныеСлучаиОборот КАК ФССНесчастныеСлучаиОборот
		               |ИЗ
		               |	РегистрНакопления.ИсчисленныеСтраховыеВзносы.Обороты(&НачалоПериода, &ОкончаниеПериода, , Организация = &Организация) КАК ИсчисленныеСтраховыеВзносыОбороты";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРПоСуммарномуТарифу)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПФРПоСуммарномуТарифуОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРНакопительная)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПФРНакопительнаяОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРСтраховая)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПФРСтраховаяОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФФОМС)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ФФОМСОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФСС)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ФССОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФССНесчастныеСлучаи)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ФССНесчастныеСлучаиОборот
		|ИЗ
		|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносамУНФ.Обороты(&НачалоПериода, &ОкончаниеПериода, , Организация = &Организация) КАК РасчетыСФондамиПоСтраховымВзносамОбороты";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(ПериодРасчета));
	
	Пакет = Запрос.ВыполнитьПакет();
	
	Выборка = Пакет[0].Выбрать();
	Если Выборка.Следующий() Тогда
		Если Год(ПериодРасчета) > 2013 Тогда
			СтруктураРасчета.ПФРСтраховаяСотрудники = Выборка.ПФРПоСуммарномуТарифуОборот;
		Иначе
			СтруктураРасчета.ПФРСтраховаяСотрудники = Выборка.ПФРСтраховаяОборот;
		КонецЕсли;
		СтруктураРасчета.ПФРНакопительнаяСотрудники = Выборка.ПФРНакопительнаяОборот;
		СтруктураРасчета.ФСССотрудники = Выборка.ФССОборот;
		СтруктураРасчета.ФОМССотрудники = Выборка.ФФОМСОборот;
		СтруктураРасчета.ФССТравматизмСотрудники = Выборка.ФССНесчастныеСлучаиОборот;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		СистемаНалогообложения = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(
		Организация, ТекущаяДатаСеанса()); 
		Если СистемаНалогообложения.ПрименяетсяАУСН Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ДатаСреза", ПериодРасчета);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСНСрезПоследних.Размер КАК Размер
			|ИЗ
			|	РегистрСведений.РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСН.СрезПоследних(&ДатаСреза, ) КАК РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСНСрезПоследних";
			
			Результат = Запрос.Выполнить().Выгрузить();
			Если Результат.Количество() = 0 Тогда
				Размер = 0;
			Иначе
				Размер = Результат[0].Размер;
			КонецЕсли;
			
			МесячныйРазмерВзноса = Окр(Размер / 12, 2); 
			
			СтруктураРасчета.ФССТравматизмСотрудники = МесячныйРазмерВзноса;
			
			СтруктураРасчета.ПФРСтраховаяСотрудники = 0; СтруктураРасчета.ПФРСтраховаяСотрудники = 0;
			СтруктураРасчета.ФСССотрудники = 0; СтруктураРасчета.ФОМССотрудники = 0;	
		КонецЕсли;
		
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Если День(СобытиеКалендаря.ДатаОкончанияСобытия) > 20 Тогда
		СтруктураРасчета.СуммаНалога = СтруктураРасчета.ПФРСтраховаяСотрудники+
		СтруктураРасчета.ПФРНакопительнаяСотрудники+
		СтруктураРасчета.ФСССотрудники+
		СтруктураРасчета.ФОМССотрудники;
	Иначе
		 СтруктураРасчета.СуммаНалога =	СтруктураРасчета.ФССТравматизмСотрудники;
	КонецЕсли;
	
	// запись состояние события календаря
	Если СобытиеКалендаря <> Неопределено Тогда
		
		КалендарьОтчетности.ЗаписатьСостояниеСобытияКалендаря(
		Организация,
		СобытиеКалендаря,
		Перечисления.СостоянияСобытийКалендаря.Ознакомиться,
		"",
		СтруктураРасчета.СуммаНалога);   	
		
	КонецЕсли;
	РегламентированнаяОтчетностьУСН.ОтразитьЗначенияПоказателейОтчетности(СтруктураРасчета); 
	
	ЗафиксироватьТранзакцию();
	
	Возврат СтруктураРасчета;
	
КонецФункции


Процедура ВыполнитьРасчетВзносовИНалоговПоСотрудникамПредварительный(Организация,ПериодРасчета, ДатаДокументаОбработкиСобытия, ЗаписьСобытия, ТринадцатыйПериод = Ложь) Экспорт
	
	ДатаНачалаОбязательногоПримененияЕНП = РегламентированнаяОтчетностьУСН.ДатаОбязательногоПримененияЕНП();
	
	Запрос = Новый Запрос;
	Если ПериодРасчета > ДатаНачалаОбязательногоПримененияЕНП 
		И ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйУчет")
		И ПериодРасчета < '20230701'Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.СуммаПриход КАК НДФЛ,
		|	0 КАК НДФЛСПревышения
		|ИЗ
		|	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Обороты(&НачалоПериода, &ДатаОкончанияРасчетаНДФЛПоДатеНачисления, , Организация = &Организация) КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты
		|ГДЕ
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.СуммаПриход
		|ИЗ
		|	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Обороты(&НачалоПериода, &ДатаОкончанияРасчетаНДФЛПоДатеНачисления, , Организация = &Организация) КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты
		|ГДЕ
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма КАК НДФЛ,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения КАК НДФЛСПревышения
		|ИЗ
		|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
		|ГДЕ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Период МЕЖДУ &НачалоПериодаНДФЛ И &ОкончаниеПериодаНДФЛ
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Активность
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ИсчисленныеСтраховыеВзносыОбороты.ПФРДоПредельнойВеличиныОборот, 0) КАК ПФРПоСуммарномуТарифуОборот,
		|	ЕСТЬNULL(ИсчисленныеСтраховыеВзносыОбороты.ПФРНакопительнаяОборот, 0) КАК ПФРНакопительнаяОборот,
		|	ЕСТЬNULL(ИсчисленныеСтраховыеВзносыОбороты.ПФРСтраховаяОборот, 0) КАК ПФРСтраховаяОборот,
		|	ЕСТЬNULL(ИсчисленныеСтраховыеВзносыОбороты.ФФОМСОборот, 0) КАК ФФОМСОборот,
		|	ЕСТЬNULL(ИсчисленныеСтраховыеВзносыОбороты.ФССОборот, 0) КАК ФССОборот,
		|	ЕСТЬNULL(ИсчисленныеСтраховыеВзносыОбороты.ФССНесчастныеСлучаиОборот, 0) КАК ФССНесчастныеСлучаиОборот
		|ИЗ
		|	РегистрНакопления.ИсчисленныеСтраховыеВзносы.Обороты(&НачалоПериода, &ОкончаниеПериода, , Организация = &Организация) КАК ИсчисленныеСтраховыеВзносыОбороты";
		
	ИначеЕсли ПериодРасчета > ДатаНачалаОбязательногоПримененияЕНП 
		И ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйУчет")
		И ПериодРасчета > '20230701'Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.СуммаПриход КАК НДФЛ,
		|	0 КАК НДФЛСПревышения
		|ИЗ
		|	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Обороты(&НачалоПериода, &ДатаОкончанияРасчетаНДФЛПоДатеНачисления, , Организация = &Организация) КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты
		|ГДЕ
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.СуммаПриход
		|ИЗ
		|	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Обороты(&НачалоПериода, &ДатаОкончанияРасчетаНДФЛПоДатеНачисления, , Организация = &Организация) КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты
		|ГДЕ
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма КАК НДФЛ,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения КАК НДФЛСПревышения
		|ИЗ
		|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
		|ГДЕ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Период МЕЖДУ &НачалоПериодаНДФЛ И &ОкончаниеПериодаНДФЛ
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Активность
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Организация = &Организация";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|	НДФЛНалогОбороты.СуммаПриход КАК НДФЛ,
		|	НДФЛНалогОбороты.СуммаСПревышенияПриход КАК НДФЛСПревышения
		|ИЗ
		|	РегистрНакопления.НДФЛРасчетыНалоговыхАгентовСБюджетом.Обороты(&НачалоПериода, &ДатаОкончанияРасчетаНДФЛПоДатеНачисления, , Организация = &Организация) КАК НДФЛНалогОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ.Сумма КАК НДФЛ,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ.СуммаСПревышения КАК НДФЛСПревышения
		|ИЗ
		|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ
		|ГДЕ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ.Период МЕЖДУ &НачалоПериодаНДФЛ И &ОкончаниеПериодаНДФЛ
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ.Активность
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРПоСуммарномуТарифу)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПФРПоСуммарномуТарифуОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРНакопительная)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПФРНакопительнаяОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРСтраховая)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПФРСтраховаяОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФФОМС)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ФФОМСОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФСС)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ФССОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФССНесчастныеСлучаи)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ФССНесчастныеСлучаиОборот
		|ИЗ
		|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносамУНФ.Обороты(&НачалоПериода, &ОкончаниеПериода, , Организация = &Организация) КАК РасчетыСФондамиПоСтраховымВзносамОбороты";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("ДатаОкончанияРасчетаНДФЛПоДатеНачисления", ДатаНачалаОбязательногоПримененияЕНП - 1);  
	
	
	Если ПериодРасчета >= ДатаНачалаОбязательногоПримененияЕНП Тогда
		Если ТринадцатыйПериод Тогда // 23-31 декабря
			ДатаНачалаОтбораНДФЛ    = Дата(Год(ПериодРасчета), Месяц(ПериодРасчета), 23);
			ДатаОкончанияОтбораНДФЛ = КонецГода(ПериодРасчета);
		ИначеЕсли НачалоМесяца(ПериодРасчета) = НачалоГода(ПериодРасчета) Тогда // Январь
			ДатаНачалаОтбораНДФЛ    = НачалоГода(ПериодРасчета);
			ДатаОкончанияОтбораНДФЛ = Дата(Год(ПериодРасчета), Месяц(ПериодРасчета), 22);
		Иначе // остальные периоды
			ДатаНачалаОтбораНДФЛ    = Дата(Год(ПериодРасчета), Месяц(ПериодРасчета)-1, 23);
			ДатаОкончанияОтбораНДФЛ = Дата(Год(ПериодРасчета), Месяц(ПериодРасчета), 22);
		КонецЕсли;
	Иначе
		ДатаНачалаОтбораНДФЛ    = НачалоМесяца(ПериодРасчета);
		ДатаОкончанияОтбораНДФЛ = КонецМесяца(ПериодРасчета)
	КонецЕсли;
	Запрос.УстановитьПараметр("НачалоПериодаНДФЛ", ДатаНачалаОтбораНДФЛ);
	Запрос.УстановитьПараметр("ОкончаниеПериодаНДФЛ", ДатаОкончанияОтбораНДФЛ);
	
	Пакет = Запрос.ВыполнитьПакет();
	Выборка = Пакет[0].Выбрать();
	
	Если Выборка.Следующий() Тогда
		НДФЛСотрудники = Выборка.НДФЛ;
		НДФЛСвышеПредельнойВеличины = Выборка.НДФЛСПревышения;  
	Иначе
		НДФЛСотрудники = 0;
		НДФЛСвышеПредельнойВеличины = 0;
	КонецЕсли;
	
	Если ПериодРасчета < '20230701' Тогда		
		Выборка = Пакет[2].Выбрать(); 			
		Если Выборка.Следующий() Тогда
			Если Год(ПериодРасчета) > 2013 Тогда
				ПФРСтраховаяСотрудники = Выборка.ПФРПоСуммарномуТарифуОборот;
			Иначе
				ПФРСтраховаяСотрудники = Выборка.ПФРСтраховаяОборот;
			КонецЕсли;
			ПФРНакопительнаяСотрудники = Выборка.ПФРНакопительнаяОборот;
			ФСССотрудники = Выборка.ФССОборот;
			ФОМССотрудники = Выборка.ФФОМСОборот;
			ФССТравматизмСотрудники = Выборка.ФССНесчастныеСлучаиОборот; 
		Иначе
			ПФРСтраховаяСотрудники = 0;
			ПФРНакопительнаяСотрудники = 0;
			ФСССотрудники = 0;
			ФОМССотрудники = 0;
		    ФССТравматизмСотрудники = 0;	
		КонецЕсли;
	КонецЕсли; 
	
	НачатьТранзакцию();
	
		// запись состояние события календаря
	Если ЗаписьСобытия <> Неопределено Тогда
		
		СуммаЗаПредыдущиеПериоды = РегламентированнаяОтчетностьУСН.ПредварительнаяСуммаНалогаЗаПредыдущиеПериоды(Организация, Справочники.ЗадачиКалендаряПодготовкиОтчетности.НалогиСотрудников, ДатаДокументаОбработкиСобытия);
		СобытиеКалендаряОбъект = ЗаписьСобытия.ПолучитьОбъект();
		
		Если ПериодРасчета < '20230701' Тогда
		СобытиеКалендаряОбъект.СуммаНалога = 
			НДФЛСотрудники+
			НДФЛСвышеПредельнойВеличины+
			ПФРСтраховаяСотрудники+
			ПФРНакопительнаяСотрудники+
			ФСССотрудники+
			ФОМССотрудники+
			ФССТравматизмСотрудники;  
		Иначе
			СобытиеКалендаряОбъект.СуммаНалога = 
			НДФЛСотрудники+
			НДФЛСвышеПредельнойВеличины;
		КонецЕсли;
		
		СобытиеКалендаряОбъект.СуммаНалога = ?(СобытиеКалендаряОбъект.СуммаНалога - СуммаЗаПредыдущиеПериоды > 0, СобытиеКалендаряОбъект.СуммаНалога - СуммаЗаПредыдущиеПериоды, 0);;
 		СобытиеКалендаряОбъект.Записать();
		
		
	КонецЕсли;
	
КонецПроцедуры    

Процедура ВыполнитьРасчетВзносовПоСотрудникамПредварительный(Организация,ПериодРасчета, ДатаДокументаОбработкиСобытия, ЗаписьСобытия, ТринадцатыйПериод = Ложь) Экспорт
	
	ДатаНачалаОбязательногоПримененияЕНП = РегламентированнаяОтчетностьУСН.ДатаОбязательногоПримененияЕНП();
	
		Запрос = Новый Запрос;
		Если ПериодРасчета > ДатаНачалаОбязательногоПримененияЕНП 
			И ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйУчет") Тогда
			Запрос.Текст = "ВЫБРАТЬ
			|	ЕСТЬNULL(ИсчисленныеСтраховыеВзносыОбороты.ПФРДоПредельнойВеличиныОборот, 0) КАК ПФРПоСуммарномуТарифуОборот,
			|	ЕСТЬNULL(ИсчисленныеСтраховыеВзносыОбороты.ПФРНакопительнаяОборот, 0) КАК ПФРНакопительнаяОборот,
			|	ЕСТЬNULL(ИсчисленныеСтраховыеВзносыОбороты.ПФРСтраховаяОборот, 0) КАК ПФРСтраховаяОборот,
			|	ЕСТЬNULL(ИсчисленныеСтраховыеВзносыОбороты.ФФОМСОборот, 0) КАК ФФОМСОборот,
			|	ЕСТЬNULL(ИсчисленныеСтраховыеВзносыОбороты.ФССОборот, 0) КАК ФССОборот,
			|	ЕСТЬNULL(ИсчисленныеСтраховыеВзносыОбороты.ФССНесчастныеСлучаиОборот, 0) КАК ФССНесчастныеСлучаиОборот
			|ИЗ
			|	РегистрНакопления.ИсчисленныеСтраховыеВзносы.Обороты(&НачалоПериода, &ОкончаниеПериода, , Организация = &Организация) КАК ИсчисленныеСтраховыеВзносыОбороты";
		Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРПоСуммарномуТарифу)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПФРПоСуммарномуТарифуОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРНакопительная)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПФРНакопительнаяОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРСтраховая)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПФРСтраховаяОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФФОМС)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ФФОМСОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФСС)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ФССОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФССНесчастныеСлучаи)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ФССНесчастныеСлучаиОборот
		|ИЗ
		|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносамУНФ.Обороты(&НачалоПериода, &ОкончаниеПериода, , Организация = &Организация) КАК РасчетыСФондамиПоСтраховымВзносамОбороты";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(ПериодРасчета));
	
	Пакет = Запрос.ВыполнитьПакет();
	
	Выборка = Пакет[0].Выбрать();
	Если Выборка.Следующий() Тогда
		Если Год(ПериодРасчета) > 2013 Тогда
			ПФРСтраховаяСотрудники = Выборка.ПФРПоСуммарномуТарифуОборот;
		Иначе
			ПФРСтраховаяСотрудники = Выборка.ПФРСтраховаяОборот;
		КонецЕсли;
		ПФРНакопительнаяСотрудники = Выборка.ПФРНакопительнаяОборот;
		ФСССотрудники = Выборка.ФССОборот;
		ФОМССотрудники = Выборка.ФФОМСОборот;
		ФССТравматизмСотрудники = Выборка.ФССНесчастныеСлучаиОборот; 
	Иначе
		ПФРСтраховаяСотрудники = 0; 
		ПФРНакопительнаяСотрудники = 0;
		ФСССотрудники = 0;
		ФОМССотрудники = 0;
		ФССТравматизмСотрудники = 0;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		СистемаНалогообложения = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(
		Организация, ТекущаяДатаСеанса()); 
		Если СистемаНалогообложения.ПрименяетсяАУСН Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ДатаСреза", ПериодРасчета);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСНСрезПоследних.Размер КАК Размер
			|ИЗ
			|	РегистрСведений.РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСН.СрезПоследних(&ДатаСреза, ) КАК РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСНСрезПоследних";
			
			Результат = Запрос.Выполнить().Выгрузить();
			Если Результат.Количество() = 0 Тогда
				Размер = 0;
			Иначе
				Размер = Результат[0].Размер;
			КонецЕсли;
			
			МесячныйРазмерВзноса = Окр(Размер / 12, 2); 
			
			ФССТравматизмСотрудники = МесячныйРазмерВзноса;
			
			ПФРСтраховаяСотрудники = 0; 
			ПФРНакопительнаяСотрудники = 0;
			ФСССотрудники = 0;
			ФОМССотрудники = 0;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НачатьТранзакцию();
	
		// запись состояние события календаря
	Если ЗаписьСобытия <> Неопределено Тогда
		
		СуммаЗаПредыдущиеПериоды = РегламентированнаяОтчетностьУСН.ПредварительнаяСуммаНалогаЗаПредыдущиеПериоды(Организация, Справочники.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыЗаСотрудников, ДатаДокументаОбработкиСобытия);
		СобытиеКалендаряОбъект = ЗаписьСобытия.ПолучитьОбъект();
		
		Если День(ЗаписьСобытия.ДатаОкончанияСобытия) > 20 Тогда		
			СобытиеКалендаряОбъект.СуммаНалога = 
			ПФРСтраховаяСотрудники+
			ПФРНакопительнаяСотрудники+
			ФСССотрудники+
			ФОМССотрудники;
		Иначе      
			СобытиеКалендаряОбъект.СуммаНалога = 
			ФССТравматизмСотрудники;			
		КонецЕсли;
		
		СобытиеКалендаряОбъект.СуммаНалога = ?(СобытиеКалендаряОбъект.СуммаНалога - СуммаЗаПредыдущиеПериоды > 0, СобытиеКалендаряОбъект.СуммаНалога - СуммаЗаПредыдущиеПериоды, 0);;
 		СобытиеКалендаряОбъект.Записать();  	
		
	КонецЕсли;
	
КонецПроцедуры


Функция ВыполнитьПроверкуНаличияДокументовПоЗарплатеСотрудников(Организация,ПериодРасчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеЗарплатыУНФ.Ссылка КАК Ссылка,
	|	НачислениеЗарплатыУНФ.ПериодРегистрации КАК ПериодРегистрации,
	|	НачислениеЗарплатыУНФ.Организация КАК Организация
	|ИЗ
	|	Документ.НачислениеЗарплатыУНФ КАК НачислениеЗарплатыУНФ
	|ГДЕ
	|	НачислениеЗарплатыУНФ.Организация = &Организация
	|	И НачислениеЗарплатыУНФ.ПериодРегистрации МЕЖДУ &НачалоКвартала И &КонецКвартала
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачислениеЗарплатыУНФ.ПериодРегистрации";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоКвартала",НачалоКвартала(ПериодРасчета));
	Запрос.УстановитьПараметр("КонецКвартала",КонецКвартала(ПериодРасчета));
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивДат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивДат.Добавить(НачалоМесяца(Выборка.ПериодРегистрации));
	КонецЦикла;
	
	ТекстПустыхМесяцев = "";
	НачальнаяДата = НачалоКвартала(ПериодРасчета);
	Для инд = 0 По 2 Цикл
		Если МассивДат.Найти(ДобавитьМесяц(НачальнаяДата, инд)) <> Неопределено Тогда
			ТекстПустыхМесяцев = ТекстПустыхМесяцев + ?(ПустаяСтрока(ТекстПустыхМесяцев),"",", ")+Формат(ДобавитьМесяц(НачальнаяДата, инд), "ДФ=MMMM");
		КонецЕсли;
	КонецЦикла;
	
	Если ПустаяСтрока(ТекстПустыхМесяцев) Тогда 
		Возврат Новый Структура("ДокументыВНаличии, ТекстУведомления",Истина,"");
	Иначе
		Возврат Новый Структура("ДокументыВНаличии, ТекстУведомления", Ложь,
			НСтр("ru = 'Отсутствуют документы Начисление зарплаты за месяцы:"+ТекстПустыхМесяцев+"
				|Если зарплата в эти месяцы начислялась, необходимо добавить и документы.'"));
	КонецЕсли;
	
КонецФункции

Функция ВыполнитьПроверкуНаличияДокументаПоЗарплатеСотрудниковЗаМесяц(Организация,ПериодРасчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеЗарплатыУНФ.Ссылка КАК Ссылка,
	|	НачислениеЗарплатыУНФ.ПериодРегистрации КАК ПериодРегистрации,
	|	НачислениеЗарплатыУНФ.Организация КАК Организация
	|ИЗ
	|	Документ.НачислениеЗарплатыУНФ КАК НачислениеЗарплатыУНФ
	|ГДЕ
	|	НачислениеЗарплатыУНФ.Организация = &Организация
	|	И НачислениеЗарплатыУНФ.ПериодРегистрации = &ПериодРегистрации
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачислениеЗарплатыУНФ.ПериодРегистрации";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации",НачалоМесяца(ПериодРасчета));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Следующий();
	
КонецФункции

Функция ИспользуетсяРегламентированнаяЗарплата(Организация) Экспорт
	
	ГоловнаяОрганизация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ГоловнаяОрганизация"); 
	
	Возврат (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГоловнаяОрганизация, "ИспользуетсяОтчетность") = Истина
	И ПолучитьФункциональнуюОпцию("ИспользоватьОтчетность")							
	И ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗарплатыДляНебольшихОрганизаций")); 
	
КонецФункции


#КонецОбласти
